/**** FileVault Strings and Formatting *****/

/* The format string used to generate the text label that appears in the FileVault conversion progress window when it is showing the progress of a user's home folder getting encrypted.  The %@ is replaced by the user's full name. */
"ENCRYPTING_MESSAGE_FORMAT" = "Encrypting %@'s Home folder";

/* The format string used to generate the text label that appears in the FileVault conversion progress window when it is showing the progress of a user's home folder getting decrypted.  The %@ is replaced by the user's full name. */
"DECRYPTING_MESSAGE_FORMAT" = "Decrypting %@'s Home folder";

/* The format string used to generate the text label that appears in the FileVault progress window when it is showing the progress of a user's home folder getting compacted.  The %@ is replaced by the user's full name. */
"COMPACTING_MESSAGE_FORMAT" = "Recovering disk space in %@'s Home folder";

/* The format string used to generate the text label that appears in the FileVault progress window when it is showing the progress of a user's home folder being backed up by TimeMachine.  The %@ is replaced by the user's full name. */
"BACKINGUP_MESSAGE_FORMAT" = "Backing up %@'s Home folder";

"CONVERTING_MESSAGE_FORMAT" = "Converting %@'s Home folder";

/* The following strings appear below the progress bar in the FileVault conversion progress window to indicate the various phases of the conversion process. */
"PHASE_PREPARING" = "Preparing...";
"PHASE_CREATING_IMAGE" = "Creating FileVault...";
"PHASE_MOUNTING_IMAGE" = "Mounting FileVault...";
"PHASE_COPYING_TO_IMAGE" = "Copying contents of Home folder to FileVault...";
"PHASE_COPY_COMPLETE" = "Copy complete...";
"PHASE_UPDATING_USER_RECORD" = "Updating user record...";
"PHASE_UNMOUNTING_IMAGE" = "Unmounting FileVault...";
"PHASE_DELETING_OLD_HOME" = "Deleting old Home folder...";
"PHASE_CANCELLING" = "Cancelling...";
"PHASE_PAUSED" = "Paused";
"PHASE_COMPACTING" = "Recovering disk space...";
"PHASE_BACKINGUP" = "Backing up...";

/* The following strings are time estimates that appear below the progress bar in the FileVault conversion progress window */
"TIME_EST_ESTIMATING" = "Estimating...";
"TIME_EST_ABOUT_5_SECONDS" = "About 5 seconds";
"TIME_EST_ABOUT_10_SECONDS" = "About 10 seconds";
"TIME_EST_UNDER_A_MINUTE" = "Less than a minute";
"TIME_EST_ABOUT_A_MINUTE" = "About a minute";
"TIME_EST_ABOUT_N_MINUTES" = "About %d minutes";
"TIME_EST_ABOUT_ONE_HOUR" = "About 1 hour";
"TIME_EST_ABOUT_ONE_HOUR_N_MINUTES" = "About 1 hour and %d minutes";
"TIME_EST_ABOUT_PLURAL_HOURS" = "About %d hours";
"TIME_EST_ABOUT_PLURAL_HOURS_PLURAL_MINUTES" = "About %1$d hours and %2$d minutes";


"TIME_REMAINING_FORMAT" = "Time remaining: %@";

/* The following strings are used to construct the confirmation alert that is presented when a user clicks the Cancel button in the FileVault progress window. */

"CANCEL_CONFIRMATION_STOP_BUTTON" = "Stop";
"CANCEL_CONFIRMATION_CONTINUE_BUTTON" = "Continue";
"CANCEL_ENCRYPT_CONFIRMATION_MESSAGE" = "Are you sure you want to stop FileVault?";
"CANCEL_ENCRYPT_CONFIRMATION_INFO" = "FileVault has not finished encrypting this home folder. If you stop now, FileVault will be turned off for this home folder and the home folder will not be encrypted.";
"CANCEL_DECRYPT_CONFIRMATION_MESSAGE" = "Are you sure you want to stop FileVault?";
"CANCEL_DECRYPT_CONFIRMATION_INFO" = "FileVault has not finished decrypting this home folder. If you stop now, FileVault will be turned on for this home folder and the home folder will still be encrypted.";

/* The following strings are used to construct the confirmation alert that is presented when a user when a compact is necessary during log out. */

"COMPACT_CONFIRMATION_CONTINUE_BUTTON" = "Continue";
"COMPACT_CONFIRMATION_SKIP_NOW_BUTTON" = "Skip Now";

"COMPACT_CONFIRMATION_MESSAGE" = "Your home folder, which is protected by FileVault, is using more disk space than necessary. FileVault can recover this space. Would you like to continue?";

"COMPACT_CONFIRMATION_INFO" = "When you click Continue, FileVault will recover the unused disk space. Although this takes a while and you cannot stop it, it's recommended that you let FileVault recover the disk space now.";


/* Error Alert strings */
"FV_ERROR_OK_BUTTON" = "OK";
"FV_ERROR_TITLE" = "An error occurred";
"FILEVAULT_ENCRYPT_ERROR_MESSAGE" = "An error occurred during encryption (%@). FileVault will be turned off for this home folder and the home folder will not be encrypted.";
"FILEVAULT_DECRYPT_ERROR_MESSAGE" = "An error occurred during decryption (%@). FileVault will be turned on for this home folder and the home folder will still be encrypted.";
"FV_COULD_NOT_CREATE_IMAGE" = "Could not create FileVault disk image";
"FV_COULD_NOT_CREATE_MOUNT_POINT_DIR" = "Could not create temporary mount point directory";
"FV_COULD_NOT_MOUNT_IMAGE_FOR_COPYING" = "Could not mount FileVault disk image for copying";
"FV_ERROR_OCCURRED_DURING_COPY" = "an error occurred during copying";
"FV_COULD_NOT_MOUNT_IMAGE_FOR_VERIFICATION" = "Could not mount FileVault disk image for verification";
"FV_VERIFICATION_FAILED" = "Verification failed";
"FV_COULD_NOT_UNMOUNT_IMAGE" = "Could not unmount FileVault disk image";
"FV_ERROR_DEFAULT" = "error %d";

